_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УстановкаСтоимостиРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УстановкаСтоимостиРесурсов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_СтоимостьРесурсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтоимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаСтарая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсСтарый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтараяРегУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсНовый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаНоваяРегУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияЦены</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СтоимостьРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СтоимостьРесурсов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_Ресурсы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Механизмы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипМеханизма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УстановкаСтоимостиРесурсов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем СтарыйРесурс; // Используется в механизмах обработчиков событий табличной части Цены

&НаКлиенте
Перем СтрокаДобавлена;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
		
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма); 	
		
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 		
		ПриЧтенииСозданииНаСервере();				
	КонецЕсли;  
	
	ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ЗаполнитьДеревоЦен();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.УСОERP_Ресурсы.Форма.ФормаВыбора" Тогда
		ПодборРесурсовКлиент( ВыбранноеЗначение, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
		
	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	ТабличнаяЧастьЦены = ТекущийОбъект.Цены;
	ТабличнаяЧастьЦены.Очистить();
	РеквизитЦенаДеревоЗначений = РеквизитФормыВЗначение("ЦенаДеревоЗначений", Тип("ДеревоЗначений"));	
	ЗаполнитьТабличнуюЧастьИзДереваЗначений(РеквизитЦенаДеревоЗначений, ТабличнаяЧастьЦены, Отказ);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_УстановкаЦенРесурсов", ПараметрыЗаписи, Объект.Ссылка);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦены

&НаКлиенте
Процедура ЦенаДеревоЗначенийРесурсОбъектСтоимостиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЦенаДеревоЗначений.ТекущиеДанные;
	ПодборРесурсовКлиент(ТекущаяСтрока.РесурсОбъектСтоимости, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаДеревоЗначенийПередНачаломИзменения(Элемент, Отказ)
	//Если ЭтоРесурс(Элементы.ЦенаДеревоЗначений.ТекущиеДанные.РесурсОбъектСтоимости) Тогда
	//	Отказ = Истина;
	//ИначеЕсли Элементы.ЦенаДеревоЗначений.ТекущийЭлемент.Имя = "ЦенаДеревоЗначенийРесурсОбъектСтоимости" Тогда
	//	Если ЗначениеЗаполнено(Элементы.ЦенаДеревоЗначений.ТекущиеДанные.РесурсОбъектСтоимости) Тогда
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦенаДеревоЗначенийПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ЦенаДеревоЗначений.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если Не ТекущиеДанные.ЭтоРесурс Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЦенаДеревоЗначенийРесурсОбъектСтоимостиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаДеревоЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
   //ЭлементыДереваЦена = ЦенаДеревоЗначений.ПолучитьЭлементы();
   //НоваяСтрока = ЭлементыДереваЦена.Добавить();
   //Элементы.ЦенаДеревоЗначений.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
   //Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦенаДеревоЗначенийВалютаНоваяПриИзменении(Элемент)
	ВалютаРегл = ПолучитьВалютуРеглУчета();
	ТекущаяСтрока = Элементы.ЦенаДеревоЗначений.ТекущиеДанные;
	НоваяВалюта	=ТекущаяСтрока.ВалютаНовая;
	Если  ВалютаРегл <> НоваяВалюта Тогда
		Коэффициенты = ПолучитьКоэффициентыПересчетаВалюты(НоваяВалюта);
		ТекущаяСтрока.ЦенаНоваяРегУчет =  ТекущаяСтрока.ЦенаНовая * Коэффициенты.КоэффициентПересчетаВВалютуРегл;
	Иначе
		ТекущаяСтрока.ЦенаНоваяРегУчет =  ТекущаяСтрока.ЦенаНовая;
	КонецЕсли;
	
	ТекущаяСтрока.КурсНовый = ПолучитьКурсВалюты(НоваяВалюта);
	ПолучитьИтогиПоРесурсуРегл(ТекущаяСтрока);
КонецПроцедуры


&НаКлиенте
Процедура ЦенаДеревоЗначенийЦенаНоваяПриИзменении(Элемент)
	ВалютаРегл 	  = ВалютаРеглУчета;
	ТекущаяСтрока = Элементы.ЦенаДеревоЗначений.ТекущиеДанные;
	ТекущаяВалюта = ТекущаяСтрока.ВалютаНовая;
	Если  ВалютаРегл <> ТекущаяВалюта Тогда
		Коэффициенты = ПолучитьКоэффициентыПересчетаВалюты(ТекущаяВалюта);
		ТекущаяСтрока.ЦенаНоваяРегУчет =  ТекущаяСтрока.ЦенаНовая * Коэффициенты.КоэффициентПересчетаВВалютуРегл;
	Иначе
		ТекущаяСтрока.ЦенаНоваяРегУчет =  ТекущаяСтрока.ЦенаНовая;
	КонецЕсли;
	ТекущаяСтрока.ПроцентИзмененияЦены = ?(ТекущаяСтрока.ЦенаСтарая = 0, 0, Окр(100*(ТекущаяСтрока.ЦенаНовая - ТекущаяСтрока.ЦенаСтарая)/ТекущаяСтрока.ЦенаСтарая,2,2));
	
	ПолучитьИтогиПоРесурсуРегл(ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЦенаДеревоЗначенийВалютаНоваяПриИзмененииСервер()
	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЦенаДеревоЗначенийПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ЦенаДеревоЗначений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Новая строка добавлена программно.
	// При отмене редактирования ее требуется удалить.
	Если СтрокаДобавлена И ОтменаРедактирования Тогда
		ЦенаДеревоЗначений.ПолучитьЭлементы().Удалить(ТекущиеДанные);
		СтрокаДобавлена = Ложь;
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.Ресурс <> СтарыйРесурс Тогда
				
		Ресурсы = ЦенаДеревоЗначений.ПолучитьЭлементы();
		Для Каждого ЭлементРесурс Из Ресурсы Цикл
			Если ЭлементРесурс.Ресурс = ТекущиеДанные.Ресурс Тогда
				Если ТекущиеДанные.ПолучитьИдентификатор() <> ЭлементРесурс.ПолучитьИдентификатор() Тогда
					Если Не ОтменаРедактирования Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Такой ресурс уже присутствует в таблице цен.");
						Элементы.ЦенаДеревоЗначений.ЗакончитьРедактированиеСтроки(Истина);
					Иначе
						ТекущиеДанные.РесурсОбъектСтоимости = СтарыйРесурс;
						ТекущиеДанные.Ресурс = СтарыйРесурс;
						ТекущиеДанные.ПолучитьЭлементы().Очистить();
						ПодборРесурсовКлиент(ТекущиеДанные.Ресурс, Неопределено);
					КонецЕсли;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	СтрокаДобавлена = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ЦенаДеревоЗначенийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ЦенаДеревоЗначений.ТекущиеДанные;
	СтарыйРесурс = ТекущиеДанные.Ресурс;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ИзменитьВалюту(Команда)
Оповещение = Новый ОписаниеОповещения("ИзменитьВалютуОбъектовСтоимостиСервер", ЭтаФорма);

ПоказатьВводЗначения(Оповещение, , , Тип("СправочникСсылка.Валюты")); 
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаПроцент(Команда)
	Оповещение = Новый ОписаниеОповещения("ИзменитьНаПроцентСервер", ЭтаФорма);
	ПоказатьВводЧисла(Оповещение, , , 10, 2)
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ОбновитьТаблицуСоответствийСтрокДерева();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыОтбора.Вставить("ЗакрыватьПриВыборе", Ложь); 
	
	ОткрытьФорму("Справочник.УСОERP_Ресурсы.Форма.ФормаВыбора", ПараметрыОтбора, ЭтаФорма,,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРесурс(Команда)
	
	ТекущийЭлемент = Элементы.ЦенаДеревоЗначений;
	
	НоваяСтрока = ЦенаДеревоЗначений.ПолучитьЭлементы().Добавить();
	Элементы.ЦенаДеревоЗначений.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	НоваяСтрока.РесурсОбъектСтоимости = ПредопределенноеЗначение("Справочник.УСОERP_Ресурсы.ПустаяСсылка");
	НоваяСтрока.ЭтоРесурс = Истина;
	Элементы.ЦенаДеревоЗначений.ИзменитьСтроку();
	
	СтрокаДобавлена = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЦенаДеревоЗначенийЦенаНовая.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЦенаДеревоЗначенийВалютаНовая.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦенаДеревоЗначений.ЭтоРесурс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЦенаДеревоЗначенийРесурсОбъектСтоимости.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦенаДеревоЗначений.ЭтоРесурс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЦенаДеревоЗначений.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦенаДеревоЗначений.ЭтоРесурс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина));

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
КонецПроцедуры	

&НаСервере
Процедура ИзменитьНаПроцентСервер(ВведенноеЧисло, Параметры) Экспорт
	
	Если ВведенноеЧисло = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	
	РеквизитЦенаДеревоЗначений = ЦенаДеревоЗначений.ПолучитьЭлементы();
	Для Каждого СтрокаРесурс Из РеквизитЦенаДеревоЗначений Цикл
	    ЦенаРесурсаРегУчет = 0;
		Для Каждого СтрокаОбъектСтоимости Из СтрокаРесурс.ПолучитьЭлементы() Цикл
			  СтрокаОбъектСтоимости.ЦенаНовая = СтрокаОбъектСтоимости.ЦенаСтарая + СтрокаОбъектСтоимости.ЦенаСтарая * ВведенноеЧисло/100;
			  Если  ВалютаРегл <> СтрокаОбъектСтоимости.ВалютаНовая Тогда
				  Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(СтрокаОбъектСтоимости.ВалютаНовая, СтрокаОбъектСтоимости.ВалютаНовая, Объект.Дата);
				  СтрокаОбъектСтоимости.ЦенаНоваяРегУчет =  СтрокаОбъектСтоимости.ЦенаНовая * Коэффициенты.КоэффициентПересчетаВВалютуРегл;
				  ЦенаРесурсаРегУчет = ЦенаРесурсаРегУчет + СтрокаОбъектСтоимости.ЦенаНоваяРегУчет; 
			  Иначе
				  СтрокаОбъектСтоимости.ЦенаНоваяРегУчет =  СтрокаОбъектСтоимости.ЦенаНовая;
				  ЦенаРесурсаРегУчет = ЦенаРесурсаРегУчет + СтрокаОбъектСтоимости.ЦенаНоваяРегУчет; 
			  КонецЕсли;
		КонецЦикла;
		// посчитать итог для реквизитов 
		СтрокаРесурс.ЦенаНоваяРегУчет = ЦенаРесурсаРегУчет
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ИзменитьВалютуОбъектовСтоимостиСервер(ВведеннаяВалюта, Параметры) Экспорт
	
	Если ВведеннаяВалюта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	
	РеквизитЦенаДеревоЗначений = ЦенаДеревоЗначений.ПолучитьЭлементы();
	Для Каждого СтрокаРесурс Из РеквизитЦенаДеревоЗначений Цикл
	    ЦенаРесурсаРегУчет = 0;
		Для Каждого СтрокаОбъектСтоимости Из СтрокаРесурс.ПолучитьЭлементы() Цикл
			  СтрокаОбъектСтоимости.ВалютаНовая = ВведеннаяВалюта;
			  СтрокаОбъектСтоимости.КурсНовый = ПолучитьКурсВалюты(ВведеннаяВалюта);

			  // пересчитать цену рег учета
			  Если  ВалютаРегл <> ВведеннаяВалюта Тогда
				  Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(СтрокаОбъектСтоимости.ВалютаНовая, СтрокаОбъектСтоимости.ВалютаНовая, Объект.Дата);
				  СтрокаОбъектСтоимости.ЦенаНоваяРегУчет =  СтрокаОбъектСтоимости.ЦенаНовая * Коэффициенты.КоэффициентПересчетаВВалютуРегл;
				  ЦенаРесурсаРегУчет = ЦенаРесурсаРегУчет + СтрокаОбъектСтоимости.ЦенаНоваяРегУчет; 
			  Иначе
				  СтрокаОбъектСтоимости.ЦенаНоваяРегУчет =  СтрокаОбъектСтоимости.ЦенаНовая;
				  ЦенаРесурсаРегУчет = ЦенаРесурсаРегУчет + СтрокаОбъектСтоимости.ЦенаНоваяРегУчет; 
			  КонецЕсли;
		КонецЦикла;
		// посчитать итог для реквизитов 
		СтрокаРесурс.ЦенаНоваяРегУчет = ЦенаРесурсаРегУчет;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодборРесурсовКлиент(ЗначенияВыбора, Параметры) Экспорт
	
	Если ЗначенияВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЗначенияВыбора) = Тип("СправочникСсылка.УСОERP_Ресурсы") Тогда
		
		ИдентификаторТекущейСтроки = Элементы.ЦенаДеревоЗначений.ТекущиеДанные.ПолучитьИдентификатор();
		ДобавлениеРесурсаСервер(ЗначенияВыбора, Параметры, ИдентификаторТекущейСтроки);
		Элементы.ЦенаДеревоЗначений.Развернуть(ИдентификаторТекущейСтроки, Истина);
		
	Иначе
		
		ПодборРесурсовСервер(ЗначенияВыбора, Параметры);
		
		Для Каждого СтрокаРесурс Из ЦенаДеревоЗначений.ПолучитьЭлементы() Цикл
			
			Элементы.ЦенаДеревоЗначений.Развернуть(СтрокаРесурс.ПолучитьИдентификатор(), Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура ДобавлениеРесурсаСервер(ЗначениеВыбора, Параметры, ИдентификаторТекущейСтроки)
	
	МассивОбъектовСтоимости = Новый Массив;
	НовыйЭлементДерева = ЦенаДеревоЗначений.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	НовыйЭлементДерева.РесурсОбъектСтоимости = ЗначениеВыбора;
	НовыйЭлементДерева.Ресурс = ЗначениеВыбора;
	НовыйЭлементДерева.ЭтоРесурс = Истина;

	
	СоставРесурса = НовыйЭлементДерева.ПолучитьЭлементы();
	СоставИзменился = Ложь;
	
	Если СоставРесурса.Количество() > 0 Тогда
		
		Если СоставРесурса[0].Ресурс <> НовыйЭлементДерева.Ресурс Тогда
			СоставИзменился = Истина;
		КонецЕсли;                                                		
		
	Иначе
		
		СоставИзменился = Истина;
		
	КонецЕсли;
	
	Если СоставИзменился Тогда
		
		НовыйЭлементДерева.ПолучитьЭлементы().Очистить();		
		
		ДобавитьИсполнителей(ЗначениеВыбора, НовыйЭлементДерева, МассивОбъектовСтоимости);
		НовыйЭлементДерева.ЭтоРесурс = Истина;
		
		ЗначенияВыбора = Новый Массив;
		ЗначенияВыбора.Добавить(ЗначениеВыбора);
		
		ТаблицаСтоимостиРесурсов = ПолучитьТаблицуСтоимостиРесурсов(МассивОбъектовСтоимости); 
		ЗаполнитьЦеныОбъектовСтоимости(ТаблицаСтоимостиРесурсов, ЗначенияВыбора);
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Процедура ПодборРесурсовСервер(ЗначенияВыбора, Параметры)
	МассивОбъектовСтоимости = Новый Массив;
	ЭлементыДереваЦен = ЦенаДеревоЗначений.ПолучитьЭлементы();
		
	Для Каждого ЗначениеВыбора Из ЗначенияВыбора Цикл
		МассивСтрок = ТаблицаСоответствийСтрокДерева.НайтиСтроки(Новый Структура("Ресурс", ЗначениеВыбора));
		Если МассивСтрок.Количество() > 0 Тогда
			НовыйЭлементДерева = ЦенаДеревоЗначений.НайтиПоИдентификатору(МассивСтрок[0].СтрокаДерева);
		Иначе
			НовыйЭлементДерева = ЭлементыДереваЦен.Добавить();
			
			НоваяСтрока = ТаблицаСоответствийСтрокДерева.Добавить();
			НоваяСтрока.Ресурс = ЗначениеВыбора;
			НоваяСтрока.СтрокаДерева = НовыйЭлементДерева.ПолучитьИдентификатор();			
		КонецЕсли;
	
		НовыйЭлементДерева.РесурсОбъектСтоимости = ЗначениеВыбора;
		НовыйЭлементДерева.Ресурс = ЗначениеВыбора;
		НовыйЭлементДерева.ЭтоРесурс = Истина;
		ДобавитьИсполнителей(ЗначениеВыбора, НовыйЭлементДерева, МассивОбъектовСтоимости);
	КонецЦикла;	
	
    ТаблицаСтоимостиРесурсов = ПолучитьТаблицуСтоимостиРесурсов(МассивОбъектовСтоимости); 
	ЗаполнитьЦеныОбъектовСтоимости(ТаблицаСтоимостиРесурсов, ЗначенияВыбора)
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИсполнителей(ТекущийРесурс, НовыйЭлементДерева, МассивОбъектовСтоимости)
	  ОбъектыСтоимостиРесурса = НовыйЭлементДерева.ПолучитьЭлементы();
	  ОбъектыСтоимостиРесурса.Очистить();
      // Добавить рабочих
	    Для Каждого СтрокаРабочий Из ТекущийРесурс.Рабочие Цикл
			  СтрокаОбъектСтоимости = ОбъектыСтоимостиРесурса.Добавить();
			  СтрокаОбъектСтоимости.РесурсОбъектСтоимости = СтрокаРабочий.Должность;
			  СтрокаОбъектСтоимости.Ресурс = НовыйЭлементДерева.Ресурс;
			  МассивОбъектовСтоимости.Добавить(СтрокаРабочий.Должность);
		КонецЦикла;	
	  // Добавить механизмы
	    Для Каждого СтрокаМеханизм Из ТекущийРесурс.Механизмы Цикл
			  СтрокаОбъектСтоимости = ОбъектыСтоимостиРесурса.Добавить();
			  СтрокаОбъектСтоимости.РесурсОбъектСтоимости = СтрокаМеханизм.ТипМеханизма;
			  СтрокаОбъектСтоимости.Ресурс = НовыйЭлементДерева.Ресурс;
			  МассивОбъектовСтоимости.Добавить(СтрокаМеханизм.ТипМеханизма);
		КонецЦикла;	
КонецПроцедуры	
	
&НаСервере
Функция ПолучитьТаблицуСтоимостиРесурсов(МассивОбъектовСтоимости)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_СтоимостьРесурсовСрезПоследних.Ресурс,
		|	УСОERP_СтоимостьРесурсовСрезПоследних.ОбъектСтоимости КАК РесурсОбъектСтоимости,
		|	УСОERP_СтоимостьРесурсовСрезПоследних.Валюта КАК ВалютаСтарая,
		|	УСОERP_СтоимостьРесурсовСрезПоследних.Курс КАК КурсСтарый,
		|	УСОERP_СтоимостьРесурсовСрезПоследних.Стоимость КАК ЦенаСтарая,
		|	0 КАК ЦенаСтараяРегУчет
		|ИЗ
		|	РегистрСведений.УСОERP_СтоимостьРесурсов.СрезПоследних(
		|			&ДатаДокумента,
		|			ОбъектСтоимости В (&МассивОбъектовСтоимости)
		|				И Регистратор <> &ДокументРегистратор
		|				И ВидЦены = &ВидЦены) КАК УСОERP_СтоимостьРесурсовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", 				Объект.Дата);
	Запрос.УстановитьПараметр("МассивОбъектовСтоимости", 	МассивОбъектовСтоимости);
	Запрос.УстановитьПараметр("ДокументРегистратор", 		Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидЦены", 					Объект.ВидЦены);
	
	СтоимостьОбъектовСтоимости = Запрос.Выполнить().Выгрузить(); 
	
	Для Каждого СтрокаСтоимостьОбъектовСтоимости Из СтоимостьОбъектовСтоимости Цикл
	   Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(СтрокаСтоимостьОбъектовСтоимости.ВалютаСтарая, СтрокаСтоимостьОбъектовСтоимости.ВалютаСтарая, Объект.Дата);
		   СтрокаСтоимостьОбъектовСтоимости.ЦенаСтараяРегУчет =  СтрокаСтоимостьОбъектовСтоимости.ЦенаСтарая *  Коэффициенты.КоэффициентПересчетаВВалютуРегл;
	КонецЦикла;
	
	Возврат СтоимостьОбъектовСтоимости;
КонецФункции

&НаСервере
Процедура ЗаполнитьЦеныОбъектовСтоимости(ТаблицаСтоимостиРесурсов, ЗначенияВыбора);
	ЭлементыДереваЦен = ЦенаДеревоЗначений.ПолучитьЭлементы();
	Для Каждого ЭлементДереваЦен Из ЭлементыДереваЦен Цикл
		
		Если ЗначенияВыбора.Найти(ЭлементДереваЦен.РесурсОбъектСтоимости) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОбъектСтоимостиЭлементДереваЦен Из ЭлементДереваЦен.ПолучитьЭлементы() Цикл
			
			ОтборОбъектовСтоимости = Новый Структура();
			ОтборОбъектовСтоимости.Вставить("Ресурс", ЭлементДереваЦен.РесурсОбъектСтоимости);
			ОтборОбъектовСтоимости.Вставить("РесурсОбъектСтоимости", ОбъектСтоимостиЭлементДереваЦен.РесурсОбъектСтоимости);
			ОбъектыСтоимостиРесурса = ТаблицаСтоимостиРесурсов.НайтиСтроки(ОтборОбъектовСтоимости); 
			Если ОбъектыСтоимостиРесурса.Количество() > 0 Тогда
				Для Каждого ОбъектСтоимостиРесурса Из ОбъектыСтоимостиРесурса Цикл
					ЗаполнитьЗначенияСвойств(ОбъектСтоимостиЭлементДереваЦен, ОбъектСтоимостиРесурса);
					ОбъектСтоимостиЭлементДереваЦен.ЦенаНовая = ОбъектСтоимостиРесурса.ЦенаСтарая;
					ОбъектСтоимостиЭлементДереваЦен.ВалютаНовая = ОбъектСтоимостиРесурса.ВалютаСтарая;
					ОбъектСтоимостиЭлементДереваЦен.КурсНовый = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ОбъектСтоимостиЭлементДереваЦен.ВалютаНовая,Объект.Дата).Курс;
					
					Если  ВалютаРеглУчета <> ОбъектСтоимостиЭлементДереваЦен.ВалютаНовая Тогда
						Коэффициенты = ПолучитьКоэффициентыПересчетаВалюты(ОбъектСтоимостиЭлементДереваЦен.ВалютаНовая);
						ОбъектСтоимостиЭлементДереваЦен.ЦенаНоваяРегУчет =  ОбъектСтоимостиЭлементДереваЦен.ЦенаНовая * Коэффициенты.КоэффициентПересчетаВВалютуРегл;
					Иначе
						ОбъектСтоимостиЭлементДереваЦен.ЦенаНоваяРегУчет =  ОбъектСтоимостиЭлементДереваЦен.ЦенаНовая;
					КонецЕсли;

					Прервать;
				Конеццикла;	
			Иначе
				ОбъектСтоимостиЭлементДереваЦен.ВалютаНовая = Объект.Валюта;
				ОбъектСтоимостиЭлементДереваЦен.КурсНовый = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ОбъектСтоимостиЭлементДереваЦен.ВалютаНовая,Объект.Дата).Курс;
			КонецЕсли;
		КонецЦикла; 	 
	КонецЦикла
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьИзДереваЗначений(РеквизитЦенаДеревоЗначений, ТабличнаяЧастьЦены, Отказ);  
	Для Каждого СтрокаРесурс Из РеквизитЦенаДеревоЗначений.Строки Цикл
		Для Каждого СтрокаОбъектСтоимости Из СтрокаРесурс.Строки Цикл
			     НоваяСтрокаТАбличнаяЧастьЦены = ТабличнаяЧастьЦены.Добавить();
			     ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнаяЧастьЦены, СтрокаОбъектСтоимости);
				 НоваяСтрокаТабличнаяЧастьЦены.Ресурс = СтрокаРесурс.РесурсОбъектСтоимости; 
				 НоваяСтрокаТабличнаяЧастьЦены.ОбъектСтоимости = СтрокаОбъектСтоимости.РесурсОбъектСтоимости;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Функция ПолучитьКурсВалюты(ТекущаяВалюта)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
	|ГДЕ
	|	КурсыВалютСрезПоследних.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Валюта", ТекущаяВалюта);
	
	
	КурсВалюты = Запрос.Выполнить().Выбрать(); 
	
	Если КурсВалюты.Следующий() Тогда	
		Возврат КурсВалюты.Курс;
	КонецЕсли;
	Возврат 1;
КонецФункции	

&НаСервере
Функция ПолучитьВалютуРеглУчета()
	ВалютаРегл	= Константы.ВалютаРегламентированногоУчета.Получить();
	Возврат ВалютаРегл; 
КонецФункции

&НаСервере
Функция ПолучитьКоэффициентыПересчетаВалюты(НоваяВалюта)
	Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(НоваяВалюта, НоваяВалюта, Объект.Дата);
	Возврат Коэффициенты; 
КонецФункции

&НаКлиенте
Процедура ПолучитьИтогиПоРесурсуРегл(ТекущаяСтрока)
	РодительТекущейСтроки = ТекущаяСтрока.ПолучитьРодителя();
	РодительТекущейСтроки.ЦенаНоваяРегУчет = 0;
	РодительТекущейСтроки.ЦенаСтараяРегУчет = 0;

	Для Каждого СтрокаРодителя Из РодительТекущейСтроки.ПолучитьЭлементы() Цикл
		  РодительТекущейСтроки.ЦенаНоваяРегУчет = РодительТекущейСтроки.ЦенаНоваяРегУчет + СтрокаРодителя.ЦенаНоваяРегУчет;
		  РодительТекущейСтроки.ЦенаСтараяРегУчет = РодительТекущейСтроки.ЦенаСтараяРегУчет + СтрокаРодителя.ЦенаСтараяРегУчет;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ЭтоРесурс(ТекущийРесурсОбъектСтоимости)
	Если ТипЗнч(ТекущийРесурсОбъектСтоимости) = Тип("СправочникСсылка.УСОERP_Ресурсы") Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

&НаСервере
Процедура ЗаполнитьДеревоЦен()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.Ресурс КАК Ресурс,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.ОбъектСтоимости КАК РесурсОбъектСтоимости,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.ВалютаСтарая,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.КурсСтарый,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.ЦенаСтарая,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.ЦенаСтараяРегУчет КАК ЦенаСтараяРегУчет,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.КурсНовый,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.ВалютаНовая,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.ЦенаНовая,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.ЦенаНоваяРегУчет КАК ЦенаНоваяРегУчет,
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.ПроцентИзмененияЦены
		|ИЗ
		|	Документ.УСОERP_УстановкаСтоимостиРесурсов.Цены КАК УСОERP_УстановкаСтоимостиРесурсовЦены
		|ГДЕ
		|	УСОERP_УстановкаСтоимостиРесурсовЦены.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(ЦенаСтараяРегУчет),
		|	СУММА(ЦенаНоваяРегУчет)
		|ПО
		|	Ресурс";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРесурс = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭлементыЦенаДеревоЗначений = ЦенаДеревоЗначений.ПолучитьЭлементы();
	Пока ВыборкаРесурс.Следующий() Цикл
	    НовыйРесурс = ЭлементыЦенаДеревоЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйРесурс, ВыборкаРесурс);
		НовыйРесурс.РесурсОбъектСтоимости = ВыборкаРесурс.Ресурс;
		НовыйРесурс.ЭтоРесурс = Истина;
		ВыборкаДетальныеЗаписи = ВыборкаРесурс.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовыйОбъектСтоимости = НовыйРесурс.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовыйОбъектСтоимости, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуСоответствийСтрокДерева()
	
	ТаблицаСоответствийСтрокДерева.Очистить();
	ЭлементыДерева = ЦенаДеревоЗначений.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл
		НоваяСтрока = ТаблицаСоответствийСтрокДерева.Добавить();
		НоваяСтрока.Ресурс = СтрокаДерева.Ресурс;
		НоваяСтрока.СтрокаДерева = СтрокаДерева.ПолучитьИдентификатор();
	КонецЦикла;
	 		
КонецПроцедуры

СтрокаДобавлена = Ложь;

#КонецОбласти
